In [3]:
person = {
    "first": "heet",
    "last": "bhatt",
    "emamil": "bhattheet177@gamil.com"
}

In [4]:
people = {
    "first": ["heet"],
    "last": ["bhatt"],
    "email": ["bhattheet177@gamil.com"]
}

In [5]:
people = {
    "first": ["heet" , 'Neel' , 'Ajay'],
    "last": ["bhatt" , 'Arora' , 'Pandey'],
    "email": ["bhattheet177@gamil.com" , 'Aroraneel@gmail.com' , 'Ajaypandey@gmail.com']
}

In [6]:
people['email']

['bhattheet177@gamil.com', 'Aroraneel@gmail.com', 'Ajaypandey@gmail.com']

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame(people)

In [9]:
df

  first    last                   email
0  heet   bhatt  bhattheet177@gamil.com
1  Neel   Arora     Aroraneel@gmail.com
2  Ajay  Pandey    Ajaypandey@gmail.com

In [10]:
df['email']

0    bhattheet177@gamil.com
1       Aroraneel@gmail.com
2      Ajaypandey@gmail.com
Name: email, dtype: object

In [11]:
type(df['email'])

pandas.core.series.Series

In [12]:
df.email

0    bhattheet177@gamil.com
1       Aroraneel@gmail.com
2      Ajaypandey@gmail.com
Name: email, dtype: object

In [13]:
df[['email', 'last']]

                    email    last
0  bhattheet177@gamil.com   bhatt
1     Aroraneel@gmail.com   Arora
2    Ajaypandey@gmail.com  Pandey

In [ ]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [15]:
df.iloc[0]

first                      heet
last                      bhatt
email    bhattheet177@gamil.com
Name: 0, dtype: object

In [16]:
df.iloc[1]

first                   Neel
last                   Arora
email    Aroraneel@gmail.com
Name: 1, dtype: object

In [17]:
df.iloc[2]

first                    Ajay
last                   Pandey
email    Ajaypandey@gmail.com
Name: 2, dtype: object

In [18]:
df.loc[[0,1,2]]

  first    last                   email
0  heet   bhatt  bhattheet177@gamil.com
1  Neel   Arora     Aroraneel@gmail.com
2  Ajay  Pandey    Ajaypandey@gmail.com

In [21]:
df.iloc[[0,1], 0]

0    heet
1    Neel
Name: first, dtype: object

In [22]:
df.loc[0]

first                      heet
last                      bhatt
email    bhattheet177@gamil.com
Name: 0, dtype: object

In [23]:
df.loc[[0,1]]

  first   last                   email
0  heet  bhatt  bhattheet177@gamil.com
1  Neel  Arora     Aroraneel@gmail.com

In [29]:
df.loc[[0,1,2] , 'first']

0    heet
1    Neel
2    Ajay
Name: first, dtype: object

In [31]:
df.loc[[0,1,2] , ['first' , 'email', 'last']]

  first                   email    last
0  heet  bhattheet177@gamil.com   bhatt
1  Neel     Aroraneel@gmail.com   Arora
2  Ajay    Ajaypandey@gmail.com  Pandey